Autodesk.Revit.DB.CylindricalFace
A cylinder face of a 3d solid.
Remarks: Cylinder faces are defined by cylinder surfaces bounded by edge loops.
The surfaces provide natural UV parameterization to the faces.
S(u, v) = Origin + cos(u)*Radius[0] + sin(u)*Radius[1] + v*Axis